rotatingLED/Rotating-LED-Display/stm32-board/src/main.c
/*******************************************************************************
 * File Name          : main.c
 * Author             : Martin Thomas, main-skeleton based on code from the
 *                      STMicroelectronics MCD Application Team
 * Version            : see VERSION_STRING below
 * Date               : see VERSION_STRING below
 * Description        : Main program body for the SD-Card tests
 ********************************************************************************
 * License: 3BSD
 *******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include "stm32f10x.h"
#include "stm32f10x_exti.h"

#include "platform_config.h"

#include <errdisplay.h>

#include "usb/usb_lib.h"
#include "usb/usb_desc.h"
#include "usb/hw_config.h"
#include "usb/usb_pwr.h"

#include "src/led_config.h"

/* Private function prototypes -----------------------------------------------*/
void Periph_Configuration(void);
void GPIO_Configuration(void);
void NVIC_Configuration(void);
void ExtInterrupt_Configuration();
void Timer_Configuration();

void stdio_tests(void);
void dcc_tests(void);

/* Public functions -- -------------------------------------------------------*/

/**
 * Sys clock handler
 */
void SysTick_Handler(void) {
  if (row_clock_counter % 1000 > 500){
    GPIOB->ODR = (1 << 10); //color: blue
  GPIOG->ODR = 0xFFFF;
  GPIOG->ODR = 0;
  }else{
    GPIOB->ODR = (1 << 11);
  GPIOG->ODR = 0xFFFF;
  GPIOG->ODR = 0;
  }
  row_clock_counter += 0x10000;
  row_clock_counter &= 0xFFFF0000;
  //row_clock_counter++;
  /*
  cnt++;
  if (cnt >= 1000) {
    cnt = 0;
    //errdisplay_aliveSign();
  }
  */
}

void USB_HP_CAN1_TX_IRQHandler(void) {
}

/**
 * Main entry point
 */
int main(void) {
  // System Clocks Configuration
  Periph_Configuration();

  // NVIC configuration
  NVIC_Configuration();

  // Configure the GPIO ports
  GPIO_Configuration();

  // Sync interrupt configuration
  ExtInterrupt_Configuration();
  __enable_irq();

  // Initialize Timer
  Timer_Configuration();

  // Setup SysTick Timer for 1 millisecond interrupts, also enables Systick and Systick-Interrupt
  // needed for SysTick_Handler
  if (SysTick_Config(SystemCoreClock / 1000)) {
    // Display error
    errdisplay_displayErr(ERROR_INIT_SYSCLOCK_FAILED);
  }

  // USB example
  Set_System();
  Set_USBClock();
  USB_Interrupts_Config();
  USB_Init();

  // Turn on/off LED(s)
  register int current_led = -1;
  register int current_row = 0;
  uint32_t time_temp = 0;

  int i = 0;
  uint32_t time_per_column = 500 << 16;
  uint32_t time_end = 0;
  uint16_t led_temp[2] = {0xFFFF, 0};
  /*
  while(1){
    asm volatile ("cpsid i");
    time_end = row_clock_counter + SysTick->VAL + time_per_column;
    time_temp = row_clock_counter + SysTick->VAL;
    time_end = row_clock_counter + time_per_column;
    GPIOB->ODR = (1 << 10); //color: blue
    GPIOD->ODR = led_temp[i];
    ++i;
    i = i % 2;

    asm volatile ("cpsie i");
    
    while(time_end > time_temp){ //TIM_GetCounter(TIM3)
      time_temp = row_clock_counter + SysTick->VAL;
    }
  }
  */
  while (1) {
    /*
     GPIOB->ODR = 0xffff;
     i++;
     GPIOD->ODR = 0xffff;
     GPIOE->ODR = 0xffff;
     GPIOF->ODR = 0xffff;
     GPIOG->ODR = 0xffff;

     sleep(1);
     GPIOD->ODR = 0x0000;
     GPIOE->ODR = 0x0000;
     GPIOF->ODR = 0x0000;
     GPIOG->ODR = 0x0000;
     */

    //Interrupts sperren
    asm volatile ("cpsid i");

    // wait for synchronisation -> just show red
    if (synchro_enable == 1 || (wait_for_start == 1 && start_frame_interrupt)){
      GPIOB->ODR = (1 << 11); //color: red
      GPIOD->ODR = 0xFFFF;
      GPIOE->ODR = 0xFFFF;
      GPIOF->ODR = 0xFFFF;
      GPIOG->ODR = 0xFFFF;
      continue;
    }

    // when the frame interrupt came, get the next frame
    if (start_frame_interrupt == 1){
      start_frame_interrupt = 0;

      uint32_t mod_multi_frame = current_multi_frame % MULTI_FRAMES_IN_IMAGE;
      current_multi_frame = current_multi_frame - mod_multi_frame 
                                      + MULTI_FRAMES_IN_IMAGE;
      if (endp3_locked == 1){
          SetEPRxValid(ENDP3);
      }
      if (current_multi_frame >= current_usb_multi_frame){
        // this is a buffer underrun, the interrupt already came
        // and the buffer is not ready, therefore enable synchro
        // enable_synchronisation();
        // continue;
      }else{
        // here we have the data, just reset the stuff right
        // -1 because current_led starts negative
        current_led = mod_multi_frame * MULTI_FRAME_SIZE - 1;
        current_row = 0;
      }
    }else{
      //two things to test in this part: buffer underruns and overruns
      
      time_temp = row_clock_counter + SysTick->VAL;
      // check if current_led needs to be set back,
      // because the clock is not ready, yet
      if (row_interrupt_time + current_row*time_per_pixel < time_temp){
        //check if the interrupt has not come, then it has nothing todo with time
        // set current_led to the last pixel
        current_led -= FRAME_SIZE;
      }else{
        // here we have the case, that the time needs to be left as it is
        // or set forward except the image is in the last row, then always set back
        if (current_row == NUM_ROWS-1){
          current_led -= FRAME_SIZE;
        }else{
          // add rows
          current_row++;
          // if there was no interrupt: set the actual current_led
          if (current_led >= (FRAME_BUFFER_LENGTH - 1)) {
            current_led = -1;
          }
          // check for multi frames
          if ((current_led % MULTI_FRAME_SIZE) == (MULTI_FRAME_SIZE - 1)){
            current_multi_frame++;
            // unlock usb endpoint 3 which is the data carrier
            if (endp3_locked == 1){
              endp3_locked = 0;
              // set the endpoint free!
              release_endp3 = 1;
            }
            // now check for whole images, so that it's never possible to jump to
            // the next image, if the interrupt for the next image came
          }
        }
      }

