rotatingLED/Rotating-LED-Display/stm32-board/src/main.c
    }
    GPIOB->ODR = (1 << 10); //color: blue
    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = 0;
    GPIOE->ODR = 0;
    GPIOF->ODR = 0;
    GPIOG->ODR = 0;

    GPIOB->ODR = (1 << 11); //color: red

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOD->ODR = frame_buffer[++current_led];
    GPIOE->ODR = frame_buffer[++current_led];
    GPIOF->ODR = frame_buffer[++current_led];
    GPIOG->ODR = frame_buffer[++current_led];

    GPIOC->ODR = 0;
    GPIOD->ODR = 0;
    GPIOE->ODR = 0;
    GPIOF->ODR = 0;
    GPIOG->ODR = 0;

    GPIOB->ODR = (1 << 12); //color: green

